app/controllers/images_controller.rb

SELECT * FROM "images" WHERE ("images"."schedule_id" IS NULL)
---
  def index
    @images = Image.all(:conditions => { :schedule_id => params[:schedule_id] })

SELECT * FROM "images" WHERE ("images"."id" = 1)
---
  def show
    @image = Image.find(params[:id])

SELECT * FROM "images" WHERE ("images"."id" = 4)
---
  def edit
    @image = Image.find(params[:id])

SELECT * FROM "schedules" WHERE ("schedules"."id" = 8)
INSERT INTO "images" ("image_file_size", "updated_at", "image_content_type", "schedule_id", "image_updated_at", "image_file_name", "created_at") VALUES(59243, '2009-11-24 01:19:21', 'image/gif', NULL, '2009-11-24 01:19:18', 'crosby_crying.gif', '2009-11-24 01:19:21')
---
  def create
    @image = Schedule.find(params[:schedule_id]).images.new(params[:image])

    respond_to do |format|
      if @image.save

SELECT * FROM "images" WHERE ("images"."id" = 13)
UPDATE "images" SET "image_file_name" = 'apod_64.jpg', "image_file_size" = 47681, "image_updated_at" = '2009-11-24 04:24:21', "updated_at" = '2009-11-24 04:24:25' WHERE "id" = 13
---
  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])

SELECT * FROM "images" WHERE ("images"."id" = 1)
DELETE FROM "images" WHERE "id" = 1
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy