app/controllers/schedules_controller.rb

  def index

    # check to see if user has selected view all button or not
    if params[:commit] == "Go"
      search_date = "#{params[:date]['get(1i)']}-#{params[:date]['get(2i)']}-#{params[:date]['get(3i)']}" rescue nil
    else
      search_date = nil
    end
    @schedules = Schedule.search_by_date(search_date).order_by_recent
---
SELECT * FROM "schedules" WHERE (date(start_time, 'start of day') = '2009-11-27') ORDER BY start_time ASC

  def show

    # any user can see any schedule
    @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 1)

  def edit

    # check to see if the current user is an admin
    # otherwise, the user must own that schedule in order to access the page
    if @current_user.is_admin?
      @schedule = Schedule.find(params[:id])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 7 AND ("schedules".user_id = 2))

  def create

    # must remember which user built the schedule
    @schedule = @current_user.schedules.build(params[:schedule])

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("number_of_pictures", "updated_at", "area_width", "area_height", "right_ascension", "iso", "shutter", "exposure", "user_id", "zoom", "duration", "start_time", "created_at", "declination") VALUES(NULL, '2009-11-21 04:28:58', NULL, NULL, '2009-11-20 00:00:00', 100, '1/1000', 9, 1, 1, '2009-11-20 14:00:00', '2012-11-21 04:25:00', '2009-11-21 04:28:58', NULL)

  def update

    # check to see if the current user is an admin
    # otherwise, the user must own that schedule in order to edit it
    if @current_user.is_admin?
      @schedule = Schedule.find(params[:id])
    else
      @schedule = @current_user.schedules.find(params[:id])
    end

    respond_to do |format|
      if @schedule.update_attributes(params[:schedule])
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 11 AND ("schedules".user_id = 5))
UPDATE "schedules" SET "start_time" = '2009-11-27 17:00:00', "declination" = 1, "shutter" = '1/1000', "zoom" = 1, "right_ascension" = '2009-11-21 00:00:00', "iso" = 100, "updated_at" = '2009-11-22 04:47:22' WHERE "id" = 10
UPDATE "users" SET "perishable_token" = 'LqB-3KwAFNeCL4psUvPX', "last_request_at" = '2009-11-13 23:42:20', "updated_at" = '2009-11-13 23:42:20' WHERE "id" = 1

  def destroy

    # check to see if the current user is an admin
    # otherwise, the user must own that schedule in order to delete it
    if @current_user.is_admin?
      @schedule = Schedule.find(params[:id])
    else
      @schedule = @current_user.schedules.find(params[:id])
    end
    @schedule.destroy
---
SELECT * FROM "schedules" WHERE ("schedules"."id" = 6 AND ("schedules".user_id = 1))
DELETE FROM "schedules" WHERE ("id" IN (1))