app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("last_login_at", "last_request_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "current_login_ip", "username", "password_salt", "current_login_at", "is_admin", "failed_login_count", "persistence_token", "login_count", "email", "last_login_ip", "created_at") VALUES(NULL, NULL, '2009-11-16 17:36:41', '527a24d2351868563d8d47d7c1c762c5b57face1450f197c165e7eff80d1c86a21a5c4960d23290baa639f6e98f78272f137fedc3895c0f54673ff8d18730dbc', 's0p9XG9xomOCxL4LZ6G_', 'SwouRMafHEeWC7PXkH33', NULL, 'admin', 'Ep9T3flyq7jSHSY4LiJx', NULL, NULL, 0, 'd424f43f86ebb66ede613379603ce52089398cce1e12db56a33fda158d00f38efd0f2878e81df5a3655278864c91faa3c6a10d61a770491a6e485f9de76dadd2', 0, 'admin@test.com', NULL, '2009-11-16 17:36:41')

  def edit
  	if admin?
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
    if admin?
      @user = User.find(params[:id])
    else
	  @user = @current_user
    end
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "login_count" = 2, "persistence_token" = '3eaeb707b6ffaf7df657bd96f070131ddfd78fa1e881542ac691e8ff1ef08f4df0568ab1e8b4224bd8266c80f73f2603bd099505d0eeee40f55ca1c465a0fb61', "perishable_token" = 'V6eoBd52h7tgjhRLuvdJ', "last_request_at" = '2009-11-16 17:54:19', "last_login_at" = '2009-11-16 17:54:00', "last_login_ip" = '127.0.0.1', "crypted_password" = 'a79f10056618df70c142385e00cc51074b66f35f04748011b81106425da164bbb7336fd6b5f9d3c14eb9b6d1d06491918afc737384e7219f9f20eab4d4894617', "updated_at" = '2009-11-16 17:54:19', "current_login_at" = '2009-11-16 17:54:19', "password_salt" = 'ihtoLb9lJynfN8b3wi3j' WHERE "id" = 5

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
DELETE FROM "users" WHERE "id" = 3